# Loops | التكرار

'''
=====================================================
'''

# 9-1
# While Loop

# لو أبغى أطبع خمس أرقام ورى بعض أقدر أكتب كذا

'''print(1)
print(2)
print(3)
print(4)
print(5)'''

"______________________________________________________"

"""
 بس هذي الطريقة ما تنفع لو أبغى الأرقام إلى 100
 لذلك راح استخدم شي أسهل وفي سطر واحد
 وهو While Loop
 
"""

'''i = 1

while i <= 5:
    print(i)
    i +=1'''

'''
=====================================================
'''

# 9-2
# For Loop

"""
كيف أطبع الاسماء الموجودة في قائمة
"""

'''students = ['Jameel','Ahmed','Saeed','Abdullah']'''
'''print(students[0])
print(students[1])
print(students[2])
print(students[3])'''

"______________________________________________________"

# الطريقة السابقة غير عملية لذلك الأسهل استخدام التالي

'''for s in students:
    print(s)'''



'''
=====================================================
'''

# 9-3
# For Loop with Range

"""
نقدر نستخدم for أو while
لكن اللي يحدد هو
أي واحد راح يخلي البرنامج أسرع وأسهل
"""

'''for n in range(10):
    print(n)'''

"______________________________________________________"

'''for n in range(5,10):
    print(n)'''

"______________________________________________________"

for l in "Welcome in":
    print(l)