# التواريخ والأرقام | Dates and Numbers

# =_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=

'''
1-1
إيجاد القيمة المطلقة
'''

# القيمة المطلقة للرقم Absolute Value

"""
number = -999

print(abs(number))
"""

# =====================================================

'''
1-2
تقريب الرقم
'''
# كيف أقرب لأقرب عدد صحيح؟

"""
num = 3.67
print(round(num)) # 4
"""
" ___________________________________________________ "

# كيف أقرب الأرقام العشرية؟

"""
num = 3.676
print(round(num,2)) # 3.68
"""
# =====================================================

'''
1-3
الرفع إلى أس
'''
# Power of Number

"""
num = 3
print(pow(num,4)) # 81
"""

# =====================================================

'''
1-4
إيجاد أكبر وأصغر قيمة
'''
# max()

"""
numbers = 300,600,786,1000,276
print(max(numbers)) # 1000
"""

" ___________________________________________________ "
# min()

"""
numbers = 300,600,786,1000,276
print(min(numbers))
"""
# =====================================================

'''
1-5
جمع مجموعة من الأرقام
'''
# sum()

"""
numbers = 300,600,786,1000,276
print(sum(numbers))
"""
# =====================================================

'''
1-6
إيجاد الجذر التربيعي
'''
# math.sqrt()

# لازم اعمل import لمكتبة math
# ( المكتبات راح يتم شرحها في المستوى التالي)

"""
import math
num = 144
print(math.sqrt(num))
"""
# =====================================================

'''
1-7
باقي القسمة
'''
# math.remainder()

"""
import math

print(math.remainder(26,5))
"""
# =====================================================

'''
1-8
إيجاد رقم عشوائي
'''
# random.randint()

# كيف أنشئ رقم عشوائي من نطاق محدد؟
# راح استخدم مكتبة random

# generate a random number between 1-100:

"""
import random

print(random.randint(1,100))
"""
# =====================================================

'''
1-9
إنشاء تاريخ
'''
"""
import datetime
date = datetime.date(2022,6,7)
print(date)
print(type(date))
print(date.year)
print(date.month)
print(date.day)
"""
# =====================================================

'''
1-10
إنشاء وقت
'''

"""
import datetime
time = datetime.time(18,56,50)
print(time)
print(type(time))
print(time.hour)
print(time.minute)
print(time.second)
"""
# =====================================================

'''
1-11
معرفة الوقت الحالي
'''

"""
import datetime

today = datetime.datetime.today()
print(today)
print(today.year)
print(today.month)
print(today.day)
print(today.hour)
print(today.minute)
print(today.second)
"""
# =====================================================

'''
1-12
تحويل التاريخ إلى نص
'''

import datetime

date = datetime.date(2020,6,8)
time = datetime.time(17,19,18)

print(date)
print(time)


" ___________________________________________________ "


# رموز تنسيق الوقت والتاريخ

"""
%a = الاسم المختصر لليوم
%A = الاسم الكامل لليوم
%w = رقم اليوم في الأسبوع 0-الأحد 6- السبت
%d =رقم اليوم في الشهر 
%j = رقم اليوم في السنة
%b = الاسم المختصر للشهر
%B = الاسم الكامل للشهر
%m = رقم الشهر في السنة
%y = رقم السنة بدون رقم القرن
%Y =رقم السنة كامل 
%H =  الساعة (بنظام 24 ساعة)
%I = الساعة (بنظام 12 ساعة )
%p = التوقيت المحلي (AM أو PM)
%M = عدد الدقائق
%S = عدد الثواني
%f = عدد الميكروثانية
"""
date_str = date.strftime('%A %B %Y')
print(date_str)
print(type(date_str))

time_str = time.strftime("%I:%M:%S %p")
print(time_str)
print(type(time_str))

# =====================================================