# أنواع البيانات المتقدمة

'''
______________________________________________________
______________________________________________________
'''

#7-1
# مقدمة
# كيف أخلي متغير واحد يكون مسؤول عن أكثر من قيمة
# Collection of Data

# نقدر نحفظها تحت ما يسمى Sequence
"""
 Sequence:
 - List
 - Tuple
 - String
 """


'''
______________________________________________________
______________________________________________________
'''

#7-2
# Lists
'''Name = 'Jameel'
Names = ['Jameel', 'Hossein', 'Ahlam','Amaal'] # القائمة تقدر تاخذ أي نوع من أنواع البيانات ومو شرط فقط string
print(Names)'''

"______________________________________________________"

"""Names = ['Jameel', 'Hossein', 'Ahlam','Amaal']"""
# القائمة تقدر تاخذ أي نوع من أنواع البيانات ومو شرط فقط string

"""Lists = ['Jameel', 'Hossein', 'Ahlam','Amaal', 5,5.5,False, None]
print(Lists)
print(type(Lists)) # يوضح أن نوع البيانات هو قائمة
# العناصر في القوائم قابلة للتغيير في أي وقت"""

'''
______________________________________________________
______________________________________________________
'''

#7-3
# الوصول للعناصر في القوائم

#كيف أوصل للبيانات ؟
"""
أقدر استخدم الـ index للوصول لعنصل معين في القائمة
"""

'''Names = ['Jameel', 'Hossein', 'Ahlam','Amaal']

# كيف أظبع العنصر الثالث فقط؟

print(Names[2])'''


'''
______________________________________________________
______________________________________________________
'''

#7-4
# تغيير العناصر في القوائم

'''Names = ['Jameel', 'Hossein', 'Ahlam','Amaal']

# كيف أغير الاسم الموجود في العنصر الأول من القائمة؟

Names[0] = 'Abdullah'
print(Names)'''

'''
______________________________________________________
______________________________________________________
'''

#7-5
# الإضافة في القوائم

'''Names = ['Jameel', 'Hossein', 'Ahlam','Amaal']'''

# كيف أضيف عنصر للقائمة السابقة؟

"""
راح نستخدم الدالة append
list.append(value)
"""

"""Names.append('Ahmed') # راح تضيف العنصر الجديد في نهاية القائمة
print(Names)"""

# طيب كيف أضيف عنصر في مكان محدد؟

"""
راح نستخدم في هذه الحالة insert
list.insert(index,value)
"""

'''Names.insert(0, 'Jameelah')
print(Names)'''

'''
______________________________________________________
______________________________________________________
'''

#7-6
# الحذف في القوائم

'''Names = ['Jameel', 'Hossein', 'Ahlam','Amaal']'''

"""
لحذف عنصر محدد أستخدم الدالة التالية:
list.remove(value)
"""

"""Names.remove('Amaal')
print(Names)"""

"______________________________________________________"

"""
لحذف جميع عناصر القائمة استخدم الدالة:
list.clear()
"""

'''Names.clear()
print(Names)'''

'''
______________________________________________________
______________________________________________________
'''

#7-7
# Tuples
"""
استخدمها عشان أضمن أن البيانات ماراح تتغير فيما بعد
غير قابلة للـ:
- التغيير
- الحذف
- الإضافة

لأن القوائم عناصرها قابلة للتغير
"""

'''child_one = ('Ahmed', 'Jeddah', '1-6-2022')
print(type(child_one)) # <class 'tuple'>'''

"______________________________________________________"

"""
كيف أوصل لعناصر الـ tuple؟
"""

'print(child_one[0]) # Ahmed'

"______________________________________________________"

"""
هنا توضيح أن الـ Tuple لا تقبل التعديل بعد الإنشاء
"""
'''child_one[0] = 'Jamel' # TypeError: 'tuple' object does not support item assignment'''

"______________________________________________________"

" طريقة أخرى لإنشاء الـ Tuple"

'''child_two = 'Ahmed', 'Jeddah', '1-6-2022'
print(type(child_two))'''

'''
______________________________________________________
______________________________________________________
'''

#7-8
# Dictionary

"""
تسهل لي طريقة الوصول للبيانات الكثيرة جدًا
عشان نوصل للبيانات دون الحاجة لحفظ رقم الـ INDEX
كل قيمة لها مفتاح معين

بحيث نوصل للقيمة عن طريق المفتاح (كأنه اسم العمود في الجداول)

dictionary = { key : value }

"""

'''child_one = {'Name': 'Ahmed', 'Birth_City' : 'Taif', 'Birth_Date': '1-6-2022'}
print(type(child_one)) # <class 'dict'>'''

'''
______________________________________________________
______________________________________________________
'''

#7-9
# الوصول إلى المفاتيح والقيم في الـ Dictionary

" dictionary[key] "

child_one = {'Name': 'Ahmed', 'Birth_City' : 'Taif', 'Birth_Date': '1-6-2022'}

print(child_one['Name']) # Ahmed

"______________________________________________________"

"""
عشان أشوف كل القيم الموجودة بداخل القواميس
dictionary.values()

"""
print(child_one.values())

"______________________________________________________"

"""
عشان أشوف كل المفاتيح بداخل القواميس
dictionary.keys()

"""
print(child_one.keys())
